Repository: NikolayKostadinov/TherapistDiary
Catalog: server/src/Core/TherapistDiary.Domain/Resources/ErrorMessages.*.resx
Languages: bg

# USER_ALREADY_EXISTS
source: User '{0}' already exists!
bg: Потребителя '{0}' съществува!

# LOGIN_FAILED
source: Invalid username: '{0}' or password!
bg: Невалидно потребителско име '{0}' или парола!

# MISSING_REFRESH_TOKEN
source: Refresh token is missing!
bg: Липсва токен за обновяване!

# UNABLE_TO_RETRIEVE_USER_FOR_RT
source: Unable to retrieve user for refresh token!
bg: Неуспешно извличане на потребител за този токен за обновяване!

source: Refresh token is expired!
bg: Tокен за обновяване e изтекъл!

# INVALID_FIELD_LENGTH
source: The field length must be between {0} and {1} symbols!
bg: Дължината на полето трябва да бъде между {0} и {1} символа!

# INVALID_NUMBER_VALUE
source: The value must be between {0} and {1}!
bg: Стойността трябва да бъде между {0} и {1}!

# INVALID_BULGARIAN_PHONE
source: The phone number you have entered {0} was invalid!
bg: Телефонният номер, който въведохте {0}, е невалиден!

# PATIENT_NOT_FOUND
source: Patient Id:'{0}' not found!
bg: Пациент Id:'{0}' не е открит!

# PAGE_NUMBER_MUST_BE_GREATER_THAN
source: The page number must be greater than {0}!
bg: Номера на страница трябва да бъде по-голям от '{0}'

# INVALID_PAGE_SIZE
source: Page size must be between '{0}' and '{1}'
bg: Размера на страницата трябва да бъде между '{0}' и '{1}'!

# THERAPIST_NOT_FOUND
source: Therapist Id:'{0}' not found!
bg: Терапевт Id:'{0}' не е открит!
